---
kind: method
id: M:Autodesk.Revit.DB.Surface.Dispose
source: html/c9ee1344-bc19-d833-52e7-dcc4931fe085.htm
---
# Autodesk.Revit.DB.Surface.Dispose Method

Releases all resources used by the Surface

## Syntax (C#)
```csharp
public void Dispose()
```